#!/bin/bash

source values.bash

iconv -f WINDOWS-1251 -t UTF-8 $1 | \
sed -r 's/\;\"/;/g' | sed -r 's/\"\;/;/g' | sed -r 's/^\"//g' | \
sed '/населенные пункты/d' | \
sed '/Районы/d' | \
sed '/сельсовета/d' | \
sed '/р\-на/d' | \
sed '/Сельсоветы/d' | \
sed '/Межселенные территории/d'| \
sed '/\/\;/d' | \
#awk 'BEGIN {FS = ";"; OFS = ";"; RS = "\n"; ORS = "\n"} \
#{ print $1, $2, $3, $4, $6, $11, $12}' | \
sed 's/c/с/g' | \
sed 's/C/С/g' | \
sed -r 's/([0-9])\;([1-9]* [А-Яа-я\"].*|[1-9]*-[А-Яа-я\"].*|[А-Яа-яN№\"])/\1\;\;\2/' | \
sed -r 's/\;\;р-н ([А-Яа-я1-9N№])/\;р-н\;\1/' | \
sed -r 's/\;\;г ([А-Яа-я1-9N№])/\;г\;\1/' | \
sed -r 's/\;\;пгт ([А-Яа-я1-9N№])/\;пгт\;\1/' | \
sed -r 's/\;\;рп ([А-Яа-я1-9N№])/\;рп\;\1/' | \
sed -r 's/\;\;кп ([А-Яа-я1-9N№])/\;кп\;\1/' | \
sed -r 's/\;\;к ([А-Яа-я1-9N№])/\;к\;\1/' | \
sed -r 's/\;\;пс ([А-Яа-я1-9N№])/\;пс\;\1/' | \
sed -r 's/\;\;дп ([А-Яа-я1-9N№])/\;дп\;\1/' | \
sed -r 's/\;\;нп ([А-Яа-я1-9N№])/\;нп\;\1/' | \
sed -r 's/\;\;п.ст ([А-Яа-я1-9N№])/\;п.ст\;\1/' | \
sed -r 's/\;\;ж\/д ст ([А-Яа-я1-9N№])/\;ж\/д ст\;\1/' | \
sed -r 's/\;\;п ж\/д ст ([А-Яа-я1-9N№])/\;п ж\/д ст\;\1/' | \
sed -r 's/\;\;п Ж\/д ст ([А-Яа-я1-9N№])/\;п ж\/д ст\;\1/' | \
sed -r 's/\;\;п ж\/д рзд ([А-Яа-я1-9N№])/\;п ж\/д рзд\;\1/' | \
sed -r 's/\;\;ж\/д рзд ([А-Яа-я1-9N№])/\;ж\/д рзд\;\1/' | \
sed -r 's/\;\;п ж\/д платформы ([А-Яа-я1-9N№])/\;п ж\/д платформы\;\1/' | \
sed -r 's/\;\;п ж\/д Платформы ([А-Яа-я1-9N№])/\;п ж\/д платформы\;\1/' | \
sed -r 's/\;\;ж\/д блокпост ([А-Яа-я1-9N№])/\;ж\/д блокпост\;\1/' | \
sed -r 's/\;\;ж\/д Блокпост ([А-Яа-я1-9N№])/\;ж\/д блокпост\;\1/' | \
sed -r 's/\;\;ж\/д будка ([А-Яа-я1-9N№])/\;ж\/д будка\;\1/' | \
sed -r 's/\;\;ж\/д Будка ([А-Яа-я1-9N№])/\;ж\/д будка\;\1/' | \
sed -r 's/\;\;ж\/д ветка ([А-Яа-я1-9N№])/\;ж\/д ветка\;\1/' | \
sed -r 's/\;\;ж\/д казарма ([А-Яа-я1-9N№])/\;ж\/д казарма\;\1/' | \
sed -r 's/\;\;ж\/д Казарма ([А-Яа-я1-9N№])/\;ж\/д казарма\;\1/' | \
sed -r 's/\;\;ж\/д комбинат ([А-Яа-я1-9N№])/\;ж\/д комбинат\;\1/' | \
sed -r 's/\;\;ж\/д платформа ([А-Яа-я1-9N№])/\;ж\/д платформа\;\1/' | \
sed -r 's/\;\;ж\/д площадка ([А-Яа-я1-9N№])/\;ж\/д площадка\;\1/' | \
sed -r 's/\;\;ж\/д путевой пост ([А-Яа-я1-9N№])/\;ж\/д путевой пост\;\1/' | \
sed -r 's/\;\;ж\/д остановочный пункт ([А-Яа-я1-9N№])/\;ж\/д остановочный пункт\;\1/' | \
sed -r 's/\;\;д ж\/д ст ([А-Яа-я1-9N№])/\;д ж\/д ст\;\1/' | \
sed -r 's/\;\;п ([А-Яа-я1-9N№])/\;п\;\1/' | \
sed -r 's/\;\;с ([А-Яа-я1-9N№])/\;с\;\1/' | \
sed -r 's/\;\;м ([А-Яа-я1-9N№])/\;м\;\1/' | \
sed -r 's/\;\;д ([А-Яа-я1-9N№])/\;д\;\1/' | \
sed -r 's/\;\;сл ([А-Яа-я1-9N№])/\;сл\;\1/' | \
sed -r 's/\;\;ст ([А-Яа-я1-9N№])/\;ст\;\1/' | \
sed -r 's/\;\;ст-ца ([А-Яа-я1-9N№])/\;ст-ца\;\1/' | \
sed -r 's/\;\;х ([А-Яа-я1-9N№])/\;х\;\1/' | \
sed -r 's/\;\;у ([А-Яа-я1-9N№])/\;у\;\1/' | \
sed -r 's/\;\;рзд ([А-Яа-я1-9N№])/\;рзд\;\1/' | \
sed -r 's/\;\;клх ([А-Яа-я1-9N№])/\;клх\;\1/' | \
sed -r 's/\;\;(.*), ж\/д ст/\;ж\/д ст\;\1/' | \
sed -r 's/\;\;(.*), остановочный пункт/\;ж\/д остановочный пункт\;\1/' | \
sed -r 's/\;\;(.*), железнодорожный рзд/\;ж\/д рзд\;\1/' | \
sed -r 's/\;\;свх ([А-Яа-я1-9N№])/\;свх\;\1/' > "$WORK_FILES_PATH"okato.csv
